{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "58d6bfe8-8d41-4807-95aa-1f2a670a36e0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import display, Image, HTML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "32df1bd5-65e3-49dc-aacf-123d99ea3083",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['/usr/lib/python310.zip', '/usr/lib/python3.10', '/usr/lib/python3.10/lib-dynload', '', '/home/tomk/environment/devpy/lib/python3.10/site-packages', '/home/tomk/Documents/Coding/gitHub/daglit/src', '/home/tomk/Documents/Coding/gitHub/datamodels/src']\n",
      "Serialization.Meta [Serialization.SerializationMetaData]\n",
      "Serialization.Serialization [Serialization.SerializationSpecs]\n",
      "Serialization.Mapping [Serialization.SerializationSpecs]\n",
      "Serialization.TranslationMapping [Serialization.SerializationSpecs]\n",
      "Serialization.MappingKVPair [Serialization.SerializationSpecs]\n",
      "Serialization.MetaClass [Serialization.Meta]\n",
      "Serialization.MetaDataProperty [Serialization.Meta]\n",
      "Serialization.MetaProperty [Serialization.Meta]\n",
      "Serialization.MetaStaticProperty [Serialization.Meta]\n",
      "Serialization.BatchDefinition [Serialization.SerializationSpecs]\n",
      "Serialization.SerializationSpecs [Serialization.SerializationMetaData]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "* Owlready2 * WARNING: ObjectProperty http://www.tkltd.org/ontologies/serialization#MappingMetaTarget belongs to more than one entity types: [owl.AnnotationProperty, owl.ObjectProperty, owl.topObjectProperty]; I'm trying to fix it...\n",
      "* Owlready2 * Running HermiT...\n",
      "    java -Xmx2000M -cp /home/tomk/environment/devpy/lib/python3.10/site-packages/owlready2/hermit:/home/tomk/environment/devpy/lib/python3.10/site-packages/owlready2/hermit/HermiT.jar org.semanticweb.HermiT.cli.CommandLine -c -O -D -I file:////tmp/tmp7jl0jm68\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Serialization.BatchNode [Serialization.DataLoad]\n",
      "Serialization.DataLoad [Serialization.SerializationMetaData]\n",
      "Serialization.SerializationMetaData [owl.Thing]\n",
      "Serialization.DataPropertyMapping [Serialization.Mapping]\n",
      "Serialization.EntityMapping [Serialization.Mapping]\n",
      "Serialization.JobNode [Serialization.DataLoad]\n",
      "Serialization.PropertyMapping [Serialization.Mapping]\n",
      "Serialization.RowNode [Serialization.DataLoad]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "* Owlready2 * HermiT took 0.696845531463623 seconds\n",
      "* Owlready * (NB: only changes on entities loaded in Python are shown, other changes are done but not listed)\n"
     ]
    }
   ],
   "source": [
    "import sys, os\n",
    "module_path = os.path.abspath(os.path.join('../src/'))\n",
    "if module_path not in sys.path:\n",
    "    sys.path.append(module_path)\n",
    "\n",
    "print(sys.path)\n",
    "import repository"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "094841c9-3d12-4af5-b612-31c48816aaf8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "755b5f85-57cf-44c1-97c7-da50d19e2866",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import URIRef, Graph, Namespace, Literal\n",
    "import pandas as pd\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7a334153-3f6f-4b8b-9cb6-952a0a130b84",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/home/tomk/Documents/Coding/gitHub/datamodels/IDE/html_test_page.html\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'test1': [193, 76], 'test2': [367, 570]}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import selenium\n",
    "from selenium import webdriver\n",
    "from selenium.webdriver.chrome.options import Options\n",
    "\n",
    "chrome_options = Options()\n",
    "#chrome_options.add_argument(\"--headless\")\n",
    "driver = webdriver.Chrome(options=chrome_options)\n",
    "#driver.get('http://selenium.dev')\n",
    "html_content=\"\"\"\n",
    "<html>\n",
    "\t<head>\n",
    "        <link rel=\"stylesheet\" type=\"text/css\" href=\"../flask-app/static/reset.css\">\n",
    "        <link rel=\"stylesheet\" type=\"text/css\" href=\"../flask-app/static/tkl_style.css\">\n",
    "    </head>\n",
    "\t<body> \n",
    "\t\t<div>\n",
    "\t\t\t<p>Test Page</>\n",
    "            <table id=\"test1\">\n",
    "                <tbody>\n",
    "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
    "                <tr><td>Oh</td><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                </tbody>\n",
    "            </table>\n",
    "\n",
    "            <table id=\"test2\">\n",
    "                <tbody>\n",
    "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Mary had a little lamb.<br>Its fleece as white as snow.<br>And everywhere that Mary went<br>The lamb was sure to go.</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                </tbody>\n",
    "            </table>\n",
    "\t\t</div>\n",
    "\t</body>\n",
    "</html>\n",
    "\"\"\"\n",
    "\n",
    "with open(\"html_test_page.html\", \"w\") as save:\n",
    "    save.write(html_content)\n",
    "\n",
    "fullpath = os.path.abspath(\"html_test_page.html\")\n",
    "print(fullpath)\n",
    "#driver.get(\"data:text/html;charset=utf-8,\"+html_content)\n",
    "driver.get(f\"file://{fullpath}\")\n",
    "th = driver.execute_script(\"return document.table_height;\")\n",
    "th = driver.execute_script(\"\"\"\n",
    "var dict = new Object();\n",
    "var a ;\n",
    "var b ;\n",
    "for (let i = 1; i < 3; i++) {\n",
    "    let a=document.getElementById(\"test\"+i).clientWidth;\n",
    "    let b=document.getElementById(\"test\"+i).clientHeight;\n",
    "    dict[\"test\"+i] = [a,b];\n",
    "}\n",
    "return dict\n",
    "    \n",
    "    \"\"\")\n",
    "#driver.quit()\n",
    "th"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dd0c3803-116a-4226-a270-6a6ddea90e1b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5afa06b1-1113-46d6-8ac4-f3661b896ad8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f8ac5abe-51d6-4db2-8d55-6496e35dd172",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<html>\n",
       "\t<head>\n",
       "        <link rel=\"stylesheet\" href=\"../flask-app/static/reset.css\">\n",
       "        <link rel=\"stylesheet\" href=\"../flask-app/static/tkl_style.css\">\n",
       "    </head>\n",
       "\t<body> \n",
       "\t\t<div>\n",
       "\t\t\t<p>Test Page</>\n",
       "            <table id=\"test1\">\n",
       "                <tbody>\n",
       "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
       "                <tr><td>Oh</td><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                </tbody>\n",
       "            </table>\n",
       "\n",
       "            <table id=\"test2\">\n",
       "                <tbody>\n",
       "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
       "                </tbody>\n",
       "            </table>\n",
       "\t\t</div>\n",
       "\t</body>\n",
       "</html>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "HTML(\"\"\"<html>\n",
    "\t<head>\n",
    "        <link rel=\"stylesheet\" href=\"../flask-app/static/reset.css\">\n",
    "        <link rel=\"stylesheet\" href=\"../flask-app/static/tkl_style.css\">\n",
    "    </head>\n",
    "\t<body> \n",
    "\t\t<div>\n",
    "\t\t\t<p>Test Page</>\n",
    "            <table id=\"test1\">\n",
    "                <tbody>\n",
    "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
    "                <tr><td>Oh</td><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                </tbody>\n",
    "            </table>\n",
    "\n",
    "            <table id=\"test2\">\n",
    "                <tbody>\n",
    "                <tr><th>Oh</th><th>One</th><th>Two</th><th>Three</th><th>Four</th></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                <tr><th>Oh</th><td>One</td><td>Two</td><td>Three</td><td>Four</td></tr>\n",
    "                </tbody>\n",
    "            </table>\n",
    "\t\t</div>\n",
    "\t</body>\n",
    "</html>\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "7ea450b1-d37a-43c4-91d0-a2286c4bf41d",
   "metadata": {},
   "outputs": [],
   "source": [
    "q_template={ \"self\" : \"PARAMETER(@selfuri)\",\n",
    "    \"contents\" : {  \"label\" : \"SPARQL(SELECT ?label WHERE {@selfuri <http://www.w3.org/2000/01/rdf-schema#label> ?label})\", \n",
    "                    \"type\" : \"SPARQL(SELECT ?type WHERE {@selfuri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?type})\",\n",
    "                    \"description\" : \"SPARQL(SELECT ?description WHERE {@selfuri <http://www.tkltd.org/ontologies/datamodel#Description> ?description})\",\n",
    "                    \"identifier\" : \"SPARQL(SELECT ?identifier WHERE {@selfuri <http://www.tkltd.org/ontologies/serialization#UniqueIdentifier> ?identifier})\",\n",
    "                    \"@attributeuri\" : \"SPARQL(SELECT ?attributeuri WHERE {@selfuri <http://www.tkltd.org/ontologies/datamodel#ClassContainsAttribute> ?attributeuri})\",\n",
    "                    \"attributes\" : { \n",
    "                        \"self\" : \"PARAMETER(@attributeuri)\",\n",
    "                        \"contents\" : {\n",
    "                            \"label\" : \"SPARQL(SELECT ?label WHERE {@attributeuri <http://www.w3.org/2000/01/rdf-schema#label> ?label})\", \n",
    "                            \"datatype\" : \"SPARQL(SELECT ?datatype WHERE {@attributeuri <http://www.tkltd.org/ontologies/datamodel#DataType> ?datatype})\",\n",
    "                            \"nulls\" : \"SPARQL(SELECT ?nulls WHERE {@attributeuri <http://www.tkltd.org/ontologies/datamodel#NullsOptional> ?nulls})\",\n",
    "                            \"optionality\" : \"SPARQL(SELECT ?optionality WHERE {@attributeuri <http://www.tkltd.org/ontologies/datamodel#Optionality> ?optionality})\",\n",
    "                            \"pk\" : \"SPARQL(SELECT ?pk WHERE {@attributeuri <http://www.tkltd.org/ontologies/datamodel#isIdentifierForClass> ?pk})\",\n",
    "                            \"identifier\" : \"SPARQL(SELECT ?identifier WHERE {@attributeuri <http://www.tkltd.org/ontologies/serialization#UniqueIdentifier> ?identifier})\",\n",
    "                            \"description\" : \"SPARQL(SELECT ?description WHERE {@attributeuri <http://www.tkltd.org/ontologies/datamodel#Description> ?description})\",\n",
    "\n",
    "\n",
    "\n",
    "                        }\n",
    "                    }\n",
    "\n",
    "}\n",
    "    \n",
    "\n",
    "}\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "efe55b61-39a5-4a16-968c-7e39bbe9ecd4",
   "metadata": {},
   "outputs": [],
   "source": [
    "def to_text(something, context=None):\n",
    "    if context is None:\n",
    "        if isinstance(something, (URIRef, Literal)):\n",
    "            return something.toPython()\n",
    "        elif isinstance(something, str):\n",
    "            return something\n",
    "        else:\n",
    "            return str(something)\n",
    "    elif context==\"sparql\":\n",
    "        if isinstance(something, (URIRef, Literal)):\n",
    "            return something.n3()\n",
    "        elif isinstance(something, str):\n",
    "            return something\n",
    "        else:\n",
    "            return str(something)\n",
    "\n",
    "def multi_replace(text, replace_parms, parameters):\n",
    "    for p in replace_parms:\n",
    "        text=text.replace(p, to_text(parameters.get(p, None), context=\"sparql\"))\n",
    "    return text\n",
    "\n",
    "def resolve_content(graph, content, parameters, scope):\n",
    "    # Given a string, unpack and resolve to some list of results\n",
    "    # parameters hosts global list of parameter options, while\n",
    "    # scope contains the current working values being processed\n",
    "    value_type_rx=re.compile(\"(SPARQL|PARAMETER)\\((.*)\\)\")\n",
    "    match_groups=value_type_rx.findall(content)\n",
    "    if match_groups is not None and len(match_groups)>0:\n",
    "        m_type, m_value = match_groups[0]\n",
    "    if m_type.lower()==\"parameter\":\n",
    "        r_val = [m_value,parameters.get(m_value, None)]\n",
    "        return r_val\n",
    "    elif m_type.lower()==\"sparql\":\n",
    "        get_parms_rx=re.compile(\"\\@[\\w]*\")\n",
    "        replace_parms = get_parms_rx.findall(m_value)\n",
    "        query = multi_replace(m_value, replace_parms, scope)\n",
    "        rs =  g.query(query)\n",
    "        return [v[0] for v in list(rs)]\n",
    "    \n",
    "\n",
    "def qt_dict(graph, template, parameters, scope=None):\n",
    "    \"\"\"Run through a node_properties extract template, each section containing a\n",
    "    self and contents section. \n",
    "    The self section defines a key value which is drawn from parameters and assigned to\n",
    "    the scope. \"\"\"\n",
    "    return_d = dict()\n",
    "    if scope is None:\n",
    "        scope=dict()\n",
    "    self_key_content = template.get('self', None)\n",
    "    \n",
    "    self_key_name, self_key_list=resolve_content(graph, self_key_content, parameters, scope)\n",
    "    for key in self_key_list:\n",
    "        return_d[key]=dict()\n",
    "        scope[self_key_name]=key\n",
    "        for header, specification in template.get('contents', {}).items():\n",
    "            if not isinstance(specification, dict):\n",
    "                resolved_content=resolve_content(graph, specification, parameters, scope)\n",
    "                return_d[key][header]=resolved_content\n",
    "                if header[0]==\"@\":\n",
    "                    parameters={**parameters, **{header:resolved_content}}\n",
    "            else:\n",
    "                return_d[key][header]=qt_dict(graph, template.get('contents').get(header), parameters, scope)\n",
    "    return return_d\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f6084776-01cb-4792-937b-bd5cc638e072",
   "metadata": {},
   "outputs": [],
   "source": [
    "store_type=\"jena\"\n",
    "#store_type=\"memory\"\n",
    "repo = repository.Repository(store_type=store_type)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "1efb8192-7071-49ec-9bab-ec84d386d39f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array([[rdflib.term.URIRef('http://www.tkltd.org/ontologies/21339b0a757045dd9ad49d3511edaaff')],\n",
       "       [rdflib.term.URIRef('http://www.tkltd.org/ontologies/b44fb8862f184e5caec0e920431e7ae3')],\n",
       "       [rdflib.term.URIRef('http://www.tkltd.org/ontologies/92fb95a62182485aa517e6de04add5e6')],\n",
       "       [rdflib.term.URIRef('http://www.tkltd.org/ontologies/5384647aafb44a2699b027da7838341a')],\n",
       "       [rdflib.term.URIRef('http://www.tkltd.org/ontologies/7deb9411c2764d5996469b4b95cd9436')],\n",
       "       [rdflib.term.URIRef('http://www.tkltd.org/ontologies/db9a929289404cb2840151ed991e3725')]],\n",
       "      dtype=object)"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "q=\"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "\n",
    "select ?s ?p ?o\n",
    "    WHERE\n",
    "    {GRAPH ?g { ?s ?p ?o. }\n",
    "FILTER (?g=<http://discourse>)\n",
    "}\n",
    "\"\"\"\n",
    "q=\"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "\n",
    "select ?s ?p ?o\n",
    "    WHERE\n",
    "    {GRAPH ?g { ?s ?p ?o. }\n",
    "FILTER (?g=<http://discourse>)\n",
    "FILTER (?p=<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>)\n",
    "FILTER (?o=<http://www.tkltd.org/ontologies/discourse#Discourse>)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "rs=repo.ds.query(q)\n",
    "pd.DataFrame([r[0] for r in rs]).values"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c0084f05-884a-4b91-a002-f7fceb821ceb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('%%p0%%', '<http://www.tkltd.org/ontologies/92fb95a62182485aa517e6de04add5e6>')\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX disco: <http://www.tkltd.org/ontologies/discourse#> \n",
      "PREFIX dcterms: <http://purl.org/dc/terms/> \n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
      "\n",
      "select ?discourse ?assertion ?refutation ?posit ?s ?p ?o\n",
      "FROM <http://discourse> \n",
      "WHERE {\n",
      "\n",
      "  {\n",
      "      ?discourse a disco:Discourse.\n",
      "      ?discourse disco:DiscourseContains+ ?declaration .\n",
      "      ?declaration a disco:Declaration .\n",
      "        OPTIONAL { ?declaration disco:Asserts ?assertion. \n",
      "                   ?assertion disco:Subject ?s.\n",
      "                   ?assertion disco:Predicate ?p.\n",
      "                   ?assertion disco:Object ?o.\n",
      "                   }\n",
      "        OPTIONAL { ?declaration disco:Refutes ?refutation. \n",
      "                   ?refutation disco:Subject ?s.\n",
      "                   ?refutation disco:Predicate ?p.\n",
      "                   ?refutation disco:Object ?o.\n",
      "                   }\n",
      "        OPTIONAL { ?declaration disco:Posits ?posit. \n",
      "                   ?posit disco:Subject ?s.\n",
      "                   ?posit disco:Predicate ?p.\n",
      "                   ?posit disco:Object ?o.\n",
      "        }\n",
      "      FILTER (?discourse IN ( <http://www.tkltd.org/ontologies/92fb95a62182485aa517e6de04add5e6> )) .\n",
      "      \n",
      "  }\n",
      "}\n",
      "494\n"
     ]
    }
   ],
   "source": [
    "discourse_e=URIRef('http://www.tkltd.org/ontologies/92fb95a62182485aa517e6de04add5e6')\n",
    "qr = repo.run_cached_query(\"get_discourse_posits_parms_discourse_iris.sparql\", parameters=[discourse_e.n3()], native_rdflib=True)\n",
    "model = URIRef('http://www.tkltd.org/ontologies/214bc10fb39f4a418e44ba9f3ad78803')\n",
    "pd.DataFrame(qr)\n",
    "g=Graph()\n",
    "for row in qr:\n",
    "        g.add((row['s'], row['p'], row['o']))\n",
    "\n",
    "print(len(g))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "9b3001d8-2063-41ef-8d04-b67b772d8c58",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[rdflib.term.URIRef('http://www.tkltd.org/ontologies/f99a8e3897434f4eb9ba375b05ad182b'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/37bf07d15e264bdc8c3fb17369bef0c6'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/27f7c559482b45afa110eeba5518ff45'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/0ca5aa25011b4d209bce931b35a9fe33'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/8cec6c4c8ebf4b6da9bd2557d44aeaea'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/e8ec4d3d6c2f42ea9efea0509d98abc4'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/25ac78e9ccdf4bbdbd0a144a31e0a79e'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/e82395098d9b40f3b5c7c0d3458e887e'),\n",
       " rdflib.term.URIRef('http://www.tkltd.org/ontologies/d35da2fdc8474d2eb99f73eb9f02f0f5')]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entity_query=\"\"\"\n",
    "SELECT ?s \n",
    "WHERE {\n",
    " ?s a <http://www.tkltd.org/ontologies/datamodel#Class>.\n",
    "}\n",
    "\"\"\"\n",
    "entity_list = [v[0] for v in list(g.query(entity_query))]\n",
    "entity_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e853e524-b274-46b8-989d-72dedb4b0d04",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e3815e63-8179-4c6b-b623-466761fa6bce",
   "metadata": {},
   "outputs": [],
   "source": [
    "e1=URIRef('http://www.tkltd.org/ontologies/f333cfb4946a4ce08a30ccb227e6ed76')\n",
    "e2=URIRef('http://www.tkltd.org/ontologies/8c8a40c3031549d6b56233892cac65bc')\n",
    "\n",
    "#rs = resolve_content(g, \"SPARQL(SELECT ?attributeuri WHERE {@selfuri <http://www.tkltd.org/ontologies/datamodel#ClassContainsAttribute> ?attributeuri})\", {\"@selfuri\" : [e1, e2]}, {\"@selfuri\" : e1})\n",
    "\n",
    "qt_d = qt_dict(g, q_template, {\"@selfuri\" : entity_list}, scope=None)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "301b0368-6ef5-496e-945e-cdf73c28bc73",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.tkltd.org/ontologies/f99a8e3897434f4eb9ba375b05ad182b\n",
      "\t label : Location\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Facility/Building operated by the organisation\n",
      "\t identifier : Inventory.Inventory.Location\n",
      "\t attributes\n",
      "\t\t label : loc_name\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Location.loc_name\n",
      "\t\t description : Name by which the location is known.\n",
      "\n",
      "\t\t label : loc_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Location.loc_id\n",
      "\t\t description : Id field of the location.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/37bf07d15e264bdc8c3fb17369bef0c6\n",
      "\t label : Inventory\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Inventory of products located at a location\n",
      "\t identifier : Inventory.Inventory.Inventory\n",
      "\t attributes\n",
      "\t\t label : p_loc_count\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Inventory.p_loc_count\n",
      "\t\t description : Count of the product at this location.\n",
      "\n",
      "\t\t label : p_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Inventory.p_id\n",
      "\t\t description : Identity of the product.\n",
      "\n",
      "\t\t label : loc_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Inventory.loc_id\n",
      "\t\t description : Identity of the location.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/27f7c559482b45afa110eeba5518ff45\n",
      "\t label : Product\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Individual products and their descriptions\n",
      "\t identifier : Inventory.Inventory.Product\n",
      "\t attributes\n",
      "\t\t label : description\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Product.description\n",
      "\t\t description : Description of the product.\n",
      "\n",
      "\t\t label : p_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Product.p_id\n",
      "\t\t description : Id field of the product by which it is coded\n",
      "\n",
      "\t\t label : p_name\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Product.p_name\n",
      "\t\t description : Unique name of the product.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/0ca5aa25011b4d209bce931b35a9fe33\n",
      "\t label : OrderItem\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : A line item that exists on a quote or order\n",
      "\t identifier : Inventory.Inventory.OrderItem\n",
      "\t attributes\n",
      "\t\t label : discount\n",
      "\t\t datatype : float\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.discount\n",
      "\t\t description : Proportion of discount to be applied to base price\n",
      "\n",
      "\t\t label : units\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.units\n",
      "\t\t description : Count of product units quoted/ordered.\n",
      "\n",
      "\t\t label : total_price\n",
      "\t\t datatype : float\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.total_price\n",
      "\t\t description : Final total price for this line item after discounting\n",
      "\n",
      "\t\t label : order_item_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.order_item_id\n",
      "\t\t description : Unique Id for this order item\n",
      "\n",
      "\t\t label : p_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.p_id\n",
      "\t\t description : Product Identifier.\n",
      "\n",
      "\t\t label : qorder_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.qorder_id\n",
      "\t\t description : Identifier for the parent quote/order.\n",
      "\n",
      "\t\t label : price_per_unit\n",
      "\t\t datatype : float\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.OrderItem.price_per_unit\n",
      "\t\t description : Base price per unit.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/8cec6c4c8ebf4b6da9bd2557d44aeaea\n",
      "\t label : PriceHistory\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Prices for each product over time.\n",
      "\t identifier : Inventory.Inventory.PriceHistory\n",
      "\t attributes\n",
      "\t\t label : start_date\n",
      "\t\t datatype : datetime\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.PriceHistory.start_date\n",
      "\t\t description : Date the price came into effect.\n",
      "\n",
      "\t\t label : price_currency\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.PriceHistory.price_currency\n",
      "\t\t description : Currency code of the price.\n",
      "\n",
      "\t\t label : p_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.PriceHistory.p_id\n",
      "\t\t description : Product Id.\n",
      "\n",
      "\t\t label : price\n",
      "\t\t datatype : float\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.PriceHistory.price\n",
      "\t\t description : Cash value associated with the product.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/e8ec4d3d6c2f42ea9efea0509d98abc4\n",
      "\t label : Customer\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : An individual who is involved in a quote or order. Subject to GDPR regulations. \n",
      "\t identifier : Inventory.Inventory.Customer\n",
      "\t attributes\n",
      "\t\t label : address_line_3\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.address_line_3\n",
      "\t\t description : Third line of customer address.\n",
      "\n",
      "\t\t label : customer_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Customer.customer_id\n",
      "\t\t description : Individual customer identifier\n",
      "\n",
      "\t\t label : address_line_1\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.address_line_1\n",
      "\t\t description : First line of customer address.\n",
      "\n",
      "\t\t label : surname\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.surname\n",
      "\t\t description : Surname of customer.\n",
      "\n",
      "\t\t label : postal_town\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.postal_town\n",
      "\t\t description : Customer address town.\n",
      "\n",
      "\t\t label : forename\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.forename\n",
      "\t\t description : Forename of customer.\n",
      "\n",
      "\t\t label : postal_code\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.postal_code\n",
      "\t\t description : Customer address post-code.\n",
      "\n",
      "\t\t label : phone_number\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.phone_number\n",
      "\t\t description : Customer Phone Number.\n",
      "\n",
      "\t\t label : address_line_2\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Customer.address_line_2\n",
      "\t\t description : Second line of customer address.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/25ac78e9ccdf4bbdbd0a144a31e0a79e\n",
      "\t label : Roles\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Working Roles\n",
      "\t identifier : Inventory.Inventory.Roles\n",
      "\t attributes\n",
      "\t\t label : role_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Roles.role_id\n",
      "\t\t description : Role Identifier.\n",
      "\n",
      "\t\t label : role_name\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Roles.role_name\n",
      "\t\t description : Role Name.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/e82395098d9b40f3b5c7c0d3458e887e\n",
      "\t label : Staff\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : Members of staff\n",
      "\t identifier : Inventory.Inventory.Staff\n",
      "\t attributes\n",
      "\t\t label : role_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Staff.role_id\n",
      "\t\t description : Assigned role to this member of staff\n",
      "\n",
      "\t\t label : staff_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.Staff.staff_id\n",
      "\t\t description : Id number of the staff member.\n",
      "\n",
      "\t\t label : loc_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Staff.loc_id\n",
      "\t\t description : Location base of this member of staff.\n",
      "\n",
      "\t\t label : surname\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Staff.surname\n",
      "\t\t description : Surname of the staff member.\n",
      "\n",
      "\t\t label : forename\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.Staff.forename\n",
      "\t\t description : Forename of the staff member.\n",
      "\n",
      "\n",
      "http://www.tkltd.org/ontologies/d35da2fdc8474d2eb99f73eb9f02f0f5\n",
      "\t label : QOrder\n",
      "\t type : http://www.tkltd.org/ontologies/datamodel#Class\n",
      "\t description : A normalised quote or order. FK link to Customer. \n",
      "\t identifier : Inventory.Inventory.QOrder\n",
      "\t attributes\n",
      "\t\t label : sales_staff_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.QOrder.sales_staff_id\n",
      "\t\t description : Who made the quote or order?\n",
      "\n",
      "\t\t label : payment_status\n",
      "\t\t datatype : boolean\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.QOrder.payment_status\n",
      "\t\t description : Indicator showing if the order has been paid.\n",
      "\n",
      "\t\t label : quote_date\n",
      "\t\t datatype : datetime\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.QOrder.quote_date\n",
      "\t\t description : Date used for calculating base prices.\n",
      "\n",
      "\t\t label : customer_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.QOrder.customer_id\n",
      "\t\t description : Individual customer identifier.\n",
      "\n",
      "\t\t label : qorder_id\n",
      "\t\t datatype : integer\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : Yes\n",
      "\t\t identifier : Inventory.Inventory.QOrder.qorder_id\n",
      "\t\t description : Unique Identifier for this qoute/order. Previously, customer was denormalised(?)\n",
      "\n",
      "\t\t label : quote_order_status\n",
      "\t\t datatype : string\n",
      "\t\t nulls : \n",
      "\t\t optionality : No\n",
      "\t\t pk : No\n",
      "\t\t identifier : Inventory.Inventory.QOrder.quote_order_status\n",
      "\t\t description : Indicator showing if this record is an order or a quote.\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for i,d in qt_d.items():\n",
    "    print(i)\n",
    "    for k,v in qt_d[i].items():\n",
    "        if isinstance(v, list) and k[0]!=\"@\":\n",
    "            print (\"\\t\", k, \":\", \",\".join([l for l in v]))\n",
    "        if isinstance(v, dict):\n",
    "            print (\"\\t\", k )\n",
    "            for kk,vv in v.items():\n",
    "                for kkk,vvv in vv.items():\n",
    "                    print (\"\\t\\t\", kkk, \":\", \". \".join([l for l in vvv]))\n",
    "                print()\n",
    "    print()\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "1c51a0b1-4f2b-4d57-8dc4-b5745be195fe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict_keys([rdflib.term.URIRef('http://www.tkltd.org/ontologies/f99a8e3897434f4eb9ba375b05ad182b'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/37bf07d15e264bdc8c3fb17369bef0c6'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/27f7c559482b45afa110eeba5518ff45'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/0ca5aa25011b4d209bce931b35a9fe33'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/8cec6c4c8ebf4b6da9bd2557d44aeaea'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/e8ec4d3d6c2f42ea9efea0509d98abc4'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/25ac78e9ccdf4bbdbd0a144a31e0a79e'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/e82395098d9b40f3b5c7c0d3458e887e'), rdflib.term.URIRef('http://www.tkltd.org/ontologies/d35da2fdc8474d2eb99f73eb9f02f0f5')])"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qt_d.keys()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "b6507b3e-4cb3-4fcb-90e2-dc95599ced37",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'label': [rdflib.term.Literal('Customer')],\n",
       " 'type': [rdflib.term.URIRef('http://www.tkltd.org/ontologies/datamodel#Class')],\n",
       " 'description': [rdflib.term.Literal('An individual who is involved in a quote or order. Subject to GDPR regulations. ')],\n",
       " 'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer')],\n",
       " '@attributeuri': [rdflib.term.URIRef('http://www.tkltd.org/ontologies/6b5dff90648d413e92b9a54fdc3ae18f'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/5c1d201b0ae34695863d66f80c00ca01'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ca3cafbc9ae5498eb104660cd1a69cae'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/c78d7221437849eda5e15d0ce7373e13'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/76a49e07ebd04f8f902c10be8c1783b0'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/058ceb8bd0ee46de80bc7cbea2570e38'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ec0ad24135a9444dbb842f396930ba0c'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/f30d3c5ee27147a19b262260d99b6014'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/b7960b15ec6541c386cf4a2edf010db1')],\n",
       " 'attributes': {rdflib.term.URIRef('http://www.tkltd.org/ontologies/6b5dff90648d413e92b9a54fdc3ae18f'): {'label': [rdflib.term.Literal('address_line_3')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.address_line_3')],\n",
       "   'description': [rdflib.term.Literal('Third line of customer address.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/5c1d201b0ae34695863d66f80c00ca01'): {'label': [rdflib.term.Literal('customer_id')],\n",
       "   'datatype': [rdflib.term.Literal('integer')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('Yes')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.customer_id')],\n",
       "   'description': [rdflib.term.Literal('Individual customer identifier')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ca3cafbc9ae5498eb104660cd1a69cae'): {'label': [rdflib.term.Literal('address_line_1')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.address_line_1')],\n",
       "   'description': [rdflib.term.Literal('First line of customer address.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/c78d7221437849eda5e15d0ce7373e13'): {'label': [rdflib.term.Literal('surname')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.surname')],\n",
       "   'description': [rdflib.term.Literal('Surname of customer.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/76a49e07ebd04f8f902c10be8c1783b0'): {'label': [rdflib.term.Literal('postal_town')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.postal_town')],\n",
       "   'description': [rdflib.term.Literal('Customer address town.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/058ceb8bd0ee46de80bc7cbea2570e38'): {'label': [rdflib.term.Literal('forename')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.forename')],\n",
       "   'description': [rdflib.term.Literal('Forename of customer.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ec0ad24135a9444dbb842f396930ba0c'): {'label': [rdflib.term.Literal('postal_code')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.postal_code')],\n",
       "   'description': [rdflib.term.Literal('Customer address post-code.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/f30d3c5ee27147a19b262260d99b6014'): {'label': [rdflib.term.Literal('phone_number')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.phone_number')],\n",
       "   'description': [rdflib.term.Literal('Customer Phone Number.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/b7960b15ec6541c386cf4a2edf010db1'): {'label': [rdflib.term.Literal('address_line_2')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.Customer.address_line_2')],\n",
       "   'description': [rdflib.term.Literal('Second line of customer address.')]}}}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "customer = URIRef('http://www.tkltd.org/ontologies/e8ec4d3d6c2f42ea9efea0509d98abc4')\n",
    "product = URIRef('http://www.tkltd.org/ontologies/27f7c559482b45afa110eeba5518ff45')\n",
    "location = URIRef('http://www.tkltd.org/ontologies/f99a8e3897434f4eb9ba375b05ad182b')\n",
    "inventory = URIRef('http://www.tkltd.org/ontologies/37bf07d15e264bdc8c3fb17369bef0c6')\n",
    "orderitem = URIRef('http://www.tkltd.org/ontologies/0ca5aa25011b4d209bce931b35a9fe33')\n",
    "price_history = URIRef('http://www.tkltd.org/ontologies/8cec6c4c8ebf4b6da9bd2557d44aeaea')\n",
    "customer = URIRef('http://www.tkltd.org/ontologies/e8ec4d3d6c2f42ea9efea0509d98abc4')\n",
    "roles = URIRef('http://www.tkltd.org/ontologies/25ac78e9ccdf4bbdbd0a144a31e0a79e')\n",
    "staff = URIRef('http://www.tkltd.org/ontologies/e82395098d9b40f3b5c7c0d3458e887e')\n",
    "qorder = URIRef('http://www.tkltd.org/ontologies/d35da2fdc8474d2eb99f73eb9f02f0f5')\n",
    "qt_d[customer]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "906714bd-da5a-4874-9c3f-f6038fba9442",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "def class_table_constructor(classdef):\n",
    "    identifier = \" \".join(classdef.get(\"identifier\"))\n",
    "    label = \" \".join(classdef.get(\"label\"))\n",
    "    description = \" \".join(classdef.get(\"description\"))\n",
    "\n",
    "    d_row=\"\"\"        <tr>\n",
    "            <td colspan=\"5\" class=\"head\">{description}</td>\n",
    "        </tr>\"\"\"\n",
    "    d_row=\"\"\n",
    "\n",
    "    class_d = {\"identifier\":identifier, \n",
    "          \"label\":label, \n",
    "          \"description\":description, \n",
    "          \"d_row\":d_row}\n",
    "\n",
    "    table = \"\"\"<table id=\"{identifier}\" width=\"600px\">\n",
    "    <caption>{label}</caption>\n",
    "    <thead>\n",
    "    {d_row}\n",
    "        <tr><th class=\"head\" width=\"25%\">Attribute</th><th class=\"head\" width=\"40%\">Description</th><th class=\"head\" width=\"10%\">Datatype</th><th class=\"head\">Nulls</th><th class=\"head\">PK</th></tr>\n",
    "    </thead>\n",
    "    <tbody>\n",
    "    {rows}\n",
    "    </tbody>\n",
    "    </table>\n",
    "    \"\"\"\n",
    "    rows = []\n",
    "    rowdef = \"\"\"<tr><th >{alabel}</th><td>{adescription}</td><td >{adatatype}</td><td >{anulls}</td><td >{apk}</td></tr>\\n\"\"\"\n",
    "    rowdef = \"\"\"<tr><th >{alabel}</th><td >{adescription}</td><td>{adatatype}</td><td>{anulls}</td><td >{apk}</td></tr>\\n\"\"\"\n",
    "    for i,a in sorted([(i,a) for i,a in classdef.get(\"attributes\").items() if \"\".join(a['pk']).lower()==\"yes\"],key=lambda x : \"\".join(x[1]['label'])):\n",
    "        a_dict={\"alabel\":\" \".join(a.get('label')),\n",
    "        \"adescription\":\" \".join(a.get('description')),\n",
    "        \"adatatype\":\" \".join(a.get('datatype')),\n",
    "        \"anulls\":\" \".join(a.get('nulls')),\n",
    "        \"apk\":\" \".join(a.get('pk'))}\n",
    "        rows.append(rowdef.format(**a_dict))\n",
    "\n",
    "    for i,a in sorted([(i,a) for i,a in classdef.get(\"attributes\").items() if \"\".join(a['pk']).lower()!=\"yes\"],key=lambda x : \"\".join(x[1]['label'])):\n",
    "        a_dict={\"alabel\":\" \".join(a.get('label')),\n",
    "        \"adescription\":\" \".join(a.get('description')),\n",
    "        \"adatatype\":\" \".join(a.get('datatype')),\n",
    "        \"anulls\":\" \".join(a.get('nulls')),\n",
    "        \"apk\":\" \".join(a.get('pk'))}\n",
    "        rows.append(rowdef.format(**a_dict))\n",
    "    rows = \" \".join(rows)\n",
    "    return table.format(**{**class_d, **{\"rows\":rows}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "079dc8f4-5e08-48c3-8e11-6abdf89437f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'label': [rdflib.term.Literal('QOrder')],\n",
       " 'type': [rdflib.term.URIRef('http://www.tkltd.org/ontologies/datamodel#Class')],\n",
       " 'description': [rdflib.term.Literal('A normalised quote or order. FK link to Customer. ')],\n",
       " 'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder')],\n",
       " '@attributeuri': [rdflib.term.URIRef('http://www.tkltd.org/ontologies/6671d87d573d480f9e8b169c24435b85'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/f47c1c8293e9456f9d8d6c8914ad8dc8'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/5988fe7ed3574fc2ba7de9d74965818e'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/418f8f3c0e484891bb2a6a506432085b'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ef8afd6df240428781355ad71c1b3728'),\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/a801f50396be453591b50e620f2dc56f')],\n",
       " 'attributes': {rdflib.term.URIRef('http://www.tkltd.org/ontologies/6671d87d573d480f9e8b169c24435b85'): {'label': [rdflib.term.Literal('sales_staff_id')],\n",
       "   'datatype': [rdflib.term.Literal('integer')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.sales_staff_id')],\n",
       "   'description': [rdflib.term.Literal('Who made the quote or order?')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/f47c1c8293e9456f9d8d6c8914ad8dc8'): {'label': [rdflib.term.Literal('payment_status')],\n",
       "   'datatype': [rdflib.term.Literal('boolean')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.payment_status')],\n",
       "   'description': [rdflib.term.Literal('Indicator showing if the order has been paid.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/5988fe7ed3574fc2ba7de9d74965818e'): {'label': [rdflib.term.Literal('quote_date')],\n",
       "   'datatype': [rdflib.term.Literal('datetime')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.quote_date')],\n",
       "   'description': [rdflib.term.Literal('Date used for calculating base prices.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/418f8f3c0e484891bb2a6a506432085b'): {'label': [rdflib.term.Literal('customer_id')],\n",
       "   'datatype': [rdflib.term.Literal('integer')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.customer_id')],\n",
       "   'description': [rdflib.term.Literal('Individual customer identifier.')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/ef8afd6df240428781355ad71c1b3728'): {'label': [rdflib.term.Literal('qorder_id')],\n",
       "   'datatype': [rdflib.term.Literal('integer')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('Yes')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.qorder_id')],\n",
       "   'description': [rdflib.term.Literal('Unique Identifier for this qoute/order. Previously, customer was denormalised(?)')]},\n",
       "  rdflib.term.URIRef('http://www.tkltd.org/ontologies/a801f50396be453591b50e620f2dc56f'): {'label': [rdflib.term.Literal('quote_order_status')],\n",
       "   'datatype': [rdflib.term.Literal('string')],\n",
       "   'nulls': [],\n",
       "   'optionality': [rdflib.term.Literal('No')],\n",
       "   'pk': [rdflib.term.Literal('No')],\n",
       "   'identifier': [rdflib.term.Literal('Inventory.Inventory.QOrder.quote_order_status')],\n",
       "   'description': [rdflib.term.Literal('Indicator showing if this record is an order or a quote.')]}}}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qt_d[qorder]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "0e2ec146-648b-4d26-ad35-760df2dc8b62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<table id=\"Inventory.Inventory.Customer\" width=\"600px\">\n",
      "    <caption>Customer</caption>\n",
      "    <thead>\n",
      "    \n",
      "        <tr><th class=\"head\" width=\"25%\">Attribute</th><th class=\"head\" width=\"40%\">Description</th><th class=\"head\" width=\"10%\">Datatype</th><th class=\"head\">Nulls</th><th class=\"head\">PK</th></tr>\n",
      "    </thead>\n",
      "    <tbody>\n",
      "    <tr><th >customer_id</th><td >Individual customer identifier</td><td>integer</td><td></td><td >Yes</td></tr>\n",
      " <tr><th >address_line_1</th><td >First line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >address_line_2</th><td >Second line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >address_line_3</th><td >Third line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >forename</th><td >Forename of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >phone_number</th><td >Customer Phone Number.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >postal_code</th><td >Customer address post-code.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >postal_town</th><td >Customer address town.</td><td>string</td><td></td><td >No</td></tr>\n",
      " <tr><th >surname</th><td >Surname of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
      "\n",
      "    </tbody>\n",
      "    </table>\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "print(class_table_constructor(qt_d[customer]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "765272af-0e91-479f-ba7d-4283d97f4e43",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table id=\"Inventory.Inventory.Customer\" width=\"600px\">\n",
       "    <caption>Customer</caption>\n",
       "    <thead>\n",
       "    \n",
       "        <tr><th class=\"head\" width=\"25%\">Attribute</th><th class=\"head\" width=\"40%\">Description</th><th class=\"head\" width=\"10%\">Datatype</th><th class=\"head\">Nulls</th><th class=\"head\">PK</th></tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "    <tr><th >customer_id</th><td >Individual customer identifier</td><td>integer</td><td></td><td >Yes</td></tr>\n",
       " <tr><th >address_line_1</th><td >First line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >address_line_2</th><td >Second line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >address_line_3</th><td >Third line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >forename</th><td >Forename of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >phone_number</th><td >Customer Phone Number.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >postal_code</th><td >Customer address post-code.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >postal_town</th><td >Customer address town.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >surname</th><td >Surname of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
       "\n",
       "    </tbody>\n",
       "    </table>\n",
       "    "
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "HTML(class_table_constructor(qt_d[customer]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "d6ef832d-99e1-4f5b-9b1c-2fe467f36d4d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/home/tomk/Documents/Coding/gitHub/datamodels/IDE/html_test_page.html\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'Inventory.Inventory.Customer': [600, 318]}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import selenium\n",
    "from selenium import webdriver\n",
    "from selenium.webdriver.chrome.options import Options\n",
    "\n",
    "chrome_options = Options()\n",
    "#chrome_options.add_argument(\"--headless\")\n",
    "driver = webdriver.Chrome(options=chrome_options)\n",
    "#driver.get('http://selenium.dev')\n",
    "ident_list=[]\n",
    "\n",
    "html_content=\"\"\"<html>\n",
    "\t<head>\n",
    "        <link rel=\"stylesheet\" href=\"../flask-app/static/reset.css\">\n",
    "        <link rel=\"stylesheet\" href=\"../flask-app/static/tkl_style.css\">\n",
    "    </head>\n",
    "    <body>\n",
    "    {table_content}\n",
    "    </body>\n",
    "    </html>\"\"\"\n",
    "\n",
    "html_content = html_content.format(table_content=class_table_constructor(qt_d[customer]))\n",
    "\n",
    "\n",
    "ident_list.append(\"\".join(qt_d[qorder].get(\"identifier\")))\n",
    "with open(\"html_test_page.html\", \"w\") as save:\n",
    "    save.write(html_content)\n",
    "\n",
    "fullpath = os.path.abspath(\"html_test_page.html\")\n",
    "print(fullpath)\n",
    "#driver.get(\"data:text/html;charset=utf-8,\"+html_content)\n",
    "driver.get(f\"file://{fullpath}\")\n",
    "th = driver.execute_script(\"return document.table_height;\")\n",
    "th = driver.execute_script(\"\"\"\n",
    "var dict = new Object();\n",
    "let a=document.getElementById(\"Inventory.Inventory.Customer\").clientWidth;\n",
    "let b=document.getElementById(\"Inventory.Inventory.Customer\").clientHeight;\n",
    "dict[\"Inventory.Inventory.Customer\"] = [a,b];\n",
    "\n",
    "return dict\n",
    "    \n",
    "    \"\"\")\n",
    "#driver.quit()\n",
    "th"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "ee2dc135-7e5b-497c-b025-0704215ea9f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "foreign_object_wrapper = \"\"\"<foreignObject x=\"10\" y=\"15\" width=\"600\" height=\"418\">\n",
    "    <body xmlns=\"http://www.w3.org/1999/xhtml\">\n",
    "        {content}\n",
    "    </body>\n",
    "</foreignObject>\"\"\".format(content=class_table_constructor(qt_d[customer]))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cfd47512-29d9-4974-ae27-9c8e0fe9bbae",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "511fb897-ab6d-41f4-97d3-ac0abd7adc9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import panel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "cb1b726d-ab8c-4f7b-9efe-2ca59e421f18",
   "metadata": {},
   "outputs": [],
   "source": [
    "table_panel = panel.Panel(loc= (0,0), size=(620, 420), corner_radius_ratio=7, title_panel_ratio=0.25)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "1988014e-5cd5-463e-a9e1-27a95ccec049",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<panel.Panel at 0x7f4754f4e9e0>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "table_panel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "5aac12df-357b-42e9-8553-2896dfb680f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def make_path(panel, title_style, panel_style):\n",
    "    path1 = \" \".join(panel._title_path_steps())\n",
    "    path2 = \" \".join(panel._panel_path_steps())\n",
    "    #stroke:none; fill:url(#pink_white);\n",
    "    #stroke:none; fill:url(#blue);\n",
    "    svg_path1 = \"\"\"<path style=\"{style}\" d=\"{p}\"> </path> \"\"\".format(p=path1, style=title_style)\n",
    "    svg_path2 = \"\"\"<path style=\"{style}\" d=\"{p}\"> </path> \"\"\".format(p=path2, style=panel_style)\n",
    "    return svg_path1 + svg_path2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "936a648a-efa9-41d8-8921-f96c0eb9921b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<panel.Panel at 0x7f4754f4e9e0>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "table_panel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "664c2c6a-40fc-4bcf-8dc1-5606d35e80fb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'<path style=\"\" d=\"M 0 105.0  L 0 7  Q 0 0 7 0  L 613 0 Q 620 0 620 7  L 620 105.0 \"> </path> <path style=\"\" d=\"M 620 105.0  L 620 413.0 Q 620 420.0 613 420.0  L 7 420.0 Q 0 420.0 0 413.0 L 0 105.0 \"> </path> '"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "make_path(table_panel, \"\", \"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4d8dd345-776a-4ef0-adb7-03882803a53e",
   "metadata": {},
   "outputs": [],
   "source": [
    "svg_chunk = \"\"\"<svg version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\"\n",
    "xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0\" y=\"0\"\n",
    "width=\"800\" height=\"500\" viewBox=\"0 0 650 500\">\n",
    "{defs}\n",
    "  <g id=\"Layer_1\">\n",
    "    <g>{foreign_object_wrapper}\n",
    "   \n",
    "    </g>\n",
    "  </g>\n",
    "  {extras}\n",
    "  </svg>\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "2cd3fced-35fa-4e10-aa74-3ccb90a968a6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<svg version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\"\n",
       "xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0\" y=\"0\"\n",
       "width=\"800\" height=\"500\" viewBox=\"0 0 650 500\">\n",
       "\n",
       "  <g id=\"Layer_1\">\n",
       "    <g><foreignObject x=\"10\" y=\"15\" width=\"600\" height=\"418\">\n",
       "    <body xmlns=\"http://www.w3.org/1999/xhtml\">\n",
       "        <table id=\"Inventory.Inventory.Customer\" width=\"600px\">\n",
       "    <caption>Customer</caption>\n",
       "    <thead>\n",
       "    \n",
       "        <tr><th class=\"head\" width=\"25%\">Attribute</th><th class=\"head\" width=\"40%\">Description</th><th class=\"head\" width=\"10%\">Datatype</th><th class=\"head\">Nulls</th><th class=\"head\">PK</th></tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "    <tr><th >customer_id</th><td >Individual customer identifier</td><td>integer</td><td></td><td >Yes</td></tr>\n",
       " <tr><th >address_line_1</th><td >First line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >address_line_2</th><td >Second line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >address_line_3</th><td >Third line of customer address.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >forename</th><td >Forename of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >phone_number</th><td >Customer Phone Number.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >postal_code</th><td >Customer address post-code.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >postal_town</th><td >Customer address town.</td><td>string</td><td></td><td >No</td></tr>\n",
       " <tr><th >surname</th><td >Surname of customer.</td><td>string</td><td></td><td >No</td></tr>\n",
       "\n",
       "    </tbody>\n",
       "    </table>\n",
       "    \n",
       "    </body>\n",
       "</foreignObject>\n",
       "   \n",
       "    </g>\n",
       "  </g>\n",
       "  \n",
       "  </svg>\n",
       "    "
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "HTML(svg_chunk.format(defs=\"\", contents=make_path(table_panel, \"\", \"\"), extras=\"\",foreign_object_wrapper=foreign_object_wrapper))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "e3c5afaf-fec7-47e6-b013-37c5d76ee2e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "t = svg_chunk.format(defs=\"\", contents=make_path(table_panel, \"\", \"\"), extras=\"\",foreign_object_wrapper=foreign_object_wrapper)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "de76cb98-dd63-4c13-b14d-8cd5e874242b",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"table.svg\", \"w\") as tsvgf:\n",
    "    tsvgf.write(t)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9a33dce9-a935-4ba1-b996-7db936b42140",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "devpy",
   "language": "python",
   "name": "devpy"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
